makingrobot/esp32-cpp-lesson/src/framework/board/i2s_driver.cpp
/**
 * ESP32-Arduino-Framework
 * Arduino开发环境下适用于ESP32芯片系列开发板的应用开发框架。
 * 
 * Author: Billy Zhang（billy_zh@126.com）
 */
#include "config.h"
#if CONFIG_USE_AUDIO==1

#include "i2s_driver.h"
#include "esp32-hal-periman.h"

#if SOC_I2S_HW_VERSION_2
#undef I2S_STD_CLK_DEFAULT_CONFIG
#define I2S_STD_CLK_DEFAULT_CONFIG(rate)        \
    {                                           \
        .sample_rate_hz = rate,                 \
        .clk_src = I2S_CLK_SRC_DEFAULT,         \
        .ext_clk_freq_hz = 0,                   \
        .mclk_multiple = I2S_MCLK_MULTIPLE_256, \
    }
#endif

#define I2S_READ_CHUNK_SIZE 1920

#define I2S_CHAN_CFG(_port)                     \
    {                                           \
        .id = _port,                            \
        .role = I2S_ROLE_MASTER,                \
        .dma_desc_num = 6,                      \
        .dma_frame_num = 240,                   \
        .auto_clear = true,                     \
        .auto_clear_before_cb = false,          \
        .intr_priority = 0                      \
    }

#define I2S_STD_CHAN_CFG(_sample_rate, _data_bit_width, _slot_mode)                  \
    {                                                                                \
        .clk_cfg = I2S_STD_CLK_DEFAULT_CONFIG(_sample_rate),                         \
        .slot_cfg = I2S_STD_PHILIP_SLOT_DEFAULT_CONFIG(_data_bit_width, _slot_mode), \
        .gpio_cfg = {                                                                \
            .mclk = (gpio_num_t)_mclk,                                               \
            .bclk = (gpio_num_t)_bclk,                                               \
            .ws = (gpio_num_t)_ws,                                                   \
            .dout = (gpio_num_t)_dout,                                               \
            .din = (gpio_num_t)_din,                                                 \
            .invert_flags =                                                          \
                {                                                                    \
                    .mclk_inv = _mclk_inv,                                           \
                    .bclk_inv = _bclk_inv,                                           \
                    .ws_inv = _ws_inv,                                               \
                },                                                                   \
        },                                                                           \
    }

#if SOC_I2S_SUPPORTS_TDM
#define I2S_TDM_CHAN_CFG(_sample_rate, _data_bit_width, _slot_mode, _mask)                  \
    {                                                                                       \
        .clk_cfg = I2S_TDM_CLK_DEFAULT_CONFIG(_sample_rate),                                \
        .slot_cfg = I2S_TDM_PHILIP_SLOT_DEFAULT_CONFIG(_data_bit_width, _slot_mode, _mask), \
        .gpio_cfg = {                                                                       \
            .mclk = (gpio_num_t)_mclk,                                                      \
            .bclk = (gpio_num_t)_bclk,                                                      \
            .ws = (gpio_num_t)_ws,                                                          \
            .dout = (gpio_num_t)_dout,                                                      \
            .din = (gpio_num_t)_din,                                                        \
            .invert_flags =                                                                 \
                {                                                                           \
                    .mclk_inv = _mclk_inv,                                                  \
                    .bclk_inv = _bclk_inv,                                                  \
                    .ws_inv = _ws_inv,                                                      \
                },                                                                          \
        },                                                                                  \
    }
#endif
#if SOC_I2S_SUPPORTS_PDM_TX
#if (SOC_I2S_PDM_MAX_TX_LINES > 1)
#define I2S_PDM_TX_CHAN_CFG(_sample_rate, _data_bit_width, _slot_mode)           \
    {                                                                            \
        .clk_cfg = I2S_PDM_TX_CLK_DEFAULT_CONFIG(_sample_rate),                  \
        .slot_cfg = I2S_PDM_TX_SLOT_DEFAULT_CONFIG(_data_bit_width, _slot_mode), \
        .gpio_cfg = {                                                            \
            .clk = (gpio_num_t)_tx_clk,                                          \
            .dout = (gpio_num_t)_tx_dout0,                                       \
            .dout2 = (gpio_num_t)_tx_dout1,                                      \
            .invert_flags =                                                      \
                {                                                                \
                    .clk_inv = _tx_clk_inv,                                      \
                },                                                               \
        },                                                                       \
    }
#else
#define I2S_PDM_TX_CHAN_CFG(_sample_rate, _data_bit_width, _slot_mode)           \
    {                                                                            \
        .clk_cfg = I2S_PDM_TX_CLK_DEFAULT_CONFIG(_sample_rate),                  \
        .slot_cfg = I2S_PDM_TX_SLOT_DEFAULT_CONFIG(_data_bit_width, _slot_mode), \
        .gpio_cfg = {                                                            \
            .clk = (gpio_num_t)_tx_clk,                                          \
            .dout = (gpio_num_t)_tx_dout0,                                       \
            .invert_flags =                                                      \
                {                                                                \
                    .clk_inv = _tx_clk_inv,                                      \
                },                                                               \
        },                                                                       \
    }
#endif
#endif

#if SOC_I2S_SUPPORTS_PDM_RX
#if (SOC_I2S_PDM_MAX_RX_LINES > 1)
#define I2S_PDM_RX_CHAN_CFG(_sample_rate, _data_bit_width, _slot_mode)           \
    {                                                                            \
        .clk_cfg = I2S_PDM_RX_CLK_DEFAULT_CONFIG(_sample_rate),                  \
        .slot_cfg = I2S_PDM_RX_SLOT_DEFAULT_CONFIG(_data_bit_width, _slot_mode), \
        .gpio_cfg = {                                                            \
            .clk = (gpio_num_t)_rx_clk,                                          \
            .dins =                                                              \
                {                                                                \
                    (gpio_num_t)_rx_din0,                                        \
                    (gpio_num_t)_rx_din1,                                        \
                    (gpio_num_t)_rx_din2,                                        \
                    (gpio_num_t)_rx_din3,                                        \
                },                                                               \
            .invert_flags =                                                      \
                {                                                                \
                    .clk_inv = _rx_clk_inv,                                      \
                },                                                               \
        },                                                                       \
    }
#else
#define I2S_PDM_RX_CHAN_CFG(_sample_rate, _data_bit_width, _slot_mode)           \
    {                                                                            \
        .clk_cfg = I2S_PDM_RX_CLK_DEFAULT_CONFIG(_sample_rate),                  \
        .slot_cfg = I2S_PDM_RX_SLOT_DEFAULT_CONFIG(_data_bit_width, _slot_mode), \
        .gpio_cfg = {                                                            \
            .clk = (gpio_num_t)_rx_clk,                                          \
            .din = (gpio_num_t)_rx_din0,                                         \
            .invert_flags =                                                      \
                {                                                                \
                    .clk_inv = _rx_clk_inv,                                      \
                },                                                               \
        },                                                                       \
    }
#endif
#endif

#define I2S_ERROR_CHECK_RETURN(x, r)                         \
    do                                                       \
    {                                                        \
        last_error = (x);                                    \
        if (unlikely(last_error != ESP_OK))                  \
        {                                                    \
            log_e("ERROR: %s", esp_err_to_name(last_error)); \
            return (r);                                      \
        }                                                    \
    } while (0)
#define I2S_ERROR_CHECK_RETURN_FALSE(x) I2S_ERROR_CHECK_RETURN(x, false)

// Default read, no resmpling and temp buffer necessary
static esp_err_t i2s_channel_read_default(i2s_chan_handle_t handle, char *tmp_buf, void *dst, size_t len, size_t *bytes_read, uint32_t timeout_ms)
{
    return i2s_channel_read(handle, (char *)dst, len, bytes_read, timeout_ms);
}

// Resample the 32bit SPH0645 microphone data into 16bit. SPH0645 is actually 18 bit, but this trick helps save some space
static esp_err_t i2s_channel_read_32_to_16(i2s_chan_handle_t handle, char *read_buff, void *dst, size_t len, size_t *bytes_read, uint32_t timeout_ms)
{
    size_t out_len = 0;
    size_t read_buff_len = len * 2;
    if (read_buff == NULL)
    {
        log_e("Temp buffer is NULL!");
        return ESP_FAIL;
    }
    esp_err_t err = i2s_channel_read(handle, read_buff, read_buff_len, &out_len, timeout_ms);
    if (err != ESP_OK)
    {
        *bytes_read = 0;
        return err;
    }
    out_len /= 4;
    uint16_t *ds = (uint16_t *)dst;
    uint32_t *src = (uint32_t *)read_buff;
    for (size_t i = 0; i < out_len; i++)
    {
        ds[i] = src[i] >> 16;
    }
    *bytes_read = out_len * 2;
    return ESP_OK;
}

// Resample the 16bit stereo microphone data into 16bit mono.
static esp_err_t i2s_channel_read_16_stereo_to_mono(i2s_chan_handle_t handle, char *read_buff, void *dst, size_t len, size_t *bytes_read, uint32_t timeout_ms)
{
    size_t out_len = 0;
    size_t read_buff_len = len * 2;
    if (read_buff == NULL)
    {
        log_e("Temp buffer is NULL!");
        return ESP_FAIL;
    }
    esp_err_t err = i2s_channel_read(handle, read_buff, read_buff_len, &out_len, timeout_ms);
    if (err != ESP_OK)
    {
        *bytes_read = 0;
        return err;
    }
    out_len /= 2;
    uint16_t *ds = (uint16_t *)dst;
    uint16_t *src = (uint16_t *)read_buff;
    for (size_t i = 0; i < out_len; i += 2)
    {
        *ds++ = src[i];
    }
    *bytes_read = out_len;
    return ESP_OK;
}

I2sDriver::I2sDriver()
{
    last_error = ESP_OK;

    tx_chan = NULL;
    tx_sample_rate = 0;
    tx_data_bit_width = I2S_DATA_BIT_WIDTH_16BIT;
    tx_slot_mode = I2S_SLOT_MODE_STEREO;

    rx_fn = i2s_channel_read_default;
    rx_transform = I2S_RX_TRANSFORM_NONE;
    rx_transform_buf = NULL;
    rx_transform_buf_len = 0;

    rx_chan = NULL;
    rx_sample_rate = 0;
    rx_data_bit_width = I2S_DATA_BIT_WIDTH_16BIT;
    rx_slot_mode = I2S_SLOT_MODE_STEREO;

    _mclk = -1;
    _bclk = -1;
    _ws = -1;
    _dout = -1;
    _din = -1;
    _mclk_inv = false;
    _bclk_inv = false;
    _ws_inv = false;

#if SOC_I2S_SUPPORTS_PDM_TX
    _tx_clk = -1;
    _tx_dout0 = -1;
    _tx_dout1 = -1;
    _tx_clk_inv = false;
#endif
#if SOC_I2S_SUPPORTS_PDM_RX
    _rx_clk = -1;
    _rx_din0 = -1;
    _rx_din1 = -1;
    _rx_din2 = -1;
    _rx_din3 = -1;
    _rx_clk_inv = false;
#endif
}

I2sDriver::~I2sDriver()
{
    end();
}

