makingrobot/esp32-cpp-lesson/src/framework/board/i2s_driver.cpp
bool I2sDriver::i2sDetachBus(void *bus_pointer)
{
    I2sDriver *bus = (I2sDriver *)bus_pointer;
    if (bus->tx_chan != NULL || bus->tx_chan != NULL)
    {
        bus->end();
    }
    return true;
}

// Set pins for STD and TDM mode
void I2sDriver::setPins(int8_t bclk, int8_t ws, int8_t dout, int8_t din, int8_t mclk)
{
    _mclk = digitalPinToGPIONumber(mclk);
    _bclk = digitalPinToGPIONumber(bclk);
    _ws = digitalPinToGPIONumber(ws);
    _dout = digitalPinToGPIONumber(dout);
    _din = digitalPinToGPIONumber(din);
}

void I2sDriver::setInverted(bool bclk, bool ws, bool mclk)
{
    _mclk_inv = mclk;
    _bclk_inv = bclk;
    _ws_inv = ws;
}

// Set pins for PDM TX mode
#if SOC_I2S_SUPPORTS_PDM_TX
void I2sDriver::setPinsPdmTx(int8_t clk, int8_t dout0, int8_t dout1)
{
    _tx_clk = digitalPinToGPIONumber(clk);
    _tx_dout0 = digitalPinToGPIONumber(dout0);
#if (SOC_I2S_PDM_MAX_TX_LINES > 1)
    _tx_dout1 = digitalPinToGPIONumber(dout1);
#endif
}
#endif

// Set pins for PDM RX mode
#if SOC_I2S_SUPPORTS_PDM_RX
void I2sDriver::setPinsPdmRx(int8_t clk, int8_t din0, int8_t din1, int8_t din2, int8_t din3)
{
    _rx_clk = digitalPinToGPIONumber(clk);
    _rx_din0 = digitalPinToGPIONumber(din0);
#if (SOC_I2S_PDM_MAX_RX_LINES > 1)
    _rx_din1 = digitalPinToGPIONumber(din1);
    _rx_din2 = digitalPinToGPIONumber(din2);
    _rx_din3 = digitalPinToGPIONumber(din3);
#endif
}
#endif

#if SOC_I2S_SUPPORTS_PDM_TX || SOC_I2S_SUPPORTS_PDM_RX
void I2sDriver::setInvertedPdm(bool clk)
{
#if SOC_I2S_SUPPORTS_PDM_TX
    _tx_clk_inv = clk;
#endif
#if SOC_I2S_SUPPORTS_PDM_RX
    _rx_clk_inv = clk;
#endif
}
#endif

bool I2sDriver::initSTD(uint32_t rate, i2s_data_bit_width_t bits_cfg, i2s_slot_mode_t ch, int8_t slot_mask)
{
    // Peripheral manager deinit previous peripheral if pin was used
    if (_mclk >= 0)
    {
        if (!perimanClearPinBus(_mclk))  return false;
    }
    if (_bclk >= 0)
    {
        if (!perimanClearPinBus(_bclk))  return false;
    }
    if (_ws >= 0)
    {
        if (!perimanClearPinBus(_ws)) return false;
    }
    if (_dout >= 0)
    {
        if (!perimanClearPinBus(_dout)) return false;
    }
    if (_din >= 0)
    {
        if (!perimanClearPinBus(_din))  return false;
    }

    // Set peripheral manager detach function for I2S
    if (_mclk >= 0)
    {
        perimanSetBusDeinit(ESP32_BUS_TYPE_I2S_STD_MCLK, I2sDriver::i2sDetachBus);
    }
    if (_bclk >= 0)
    {
        perimanSetBusDeinit(ESP32_BUS_TYPE_I2S_STD_BCLK, I2sDriver::i2sDetachBus);
    }
    if (_ws >= 0)
    {
        perimanSetBusDeinit(ESP32_BUS_TYPE_I2S_STD_WS, I2sDriver::i2sDetachBus);
    }
    if (_dout >= 0)
    {
        perimanSetBusDeinit(ESP32_BUS_TYPE_I2S_STD_DOUT, I2sDriver::i2sDetachBus);
    }
    if (_din >= 0)
    {
        perimanSetBusDeinit(ESP32_BUS_TYPE_I2S_STD_DIN, I2sDriver::i2sDetachBus);
    }

    // I2S configuration
    if (_dout >= 0 && _din >= 0)
    {
        i2s_chan_config_t chan_cfg = I2S_CHAN_CFG(I2S_NUM_AUTO);
        I2S_ERROR_CHECK_RETURN_FALSE(i2s_new_channel(&chan_cfg, &tx_chan, &rx_chan));
    }
    else if (_dout >= 0)
    {
        i2s_chan_config_t chan_cfg = I2S_CHAN_CFG(I2S_NUM_1);
        I2S_ERROR_CHECK_RETURN_FALSE(i2s_new_channel(&chan_cfg, &tx_chan, NULL));
    }
    else if (_din >= 0)
    {
        i2s_chan_config_t chan_cfg = I2S_CHAN_CFG(I2S_NUM_0);
        I2S_ERROR_CHECK_RETURN_FALSE(i2s_new_channel(&chan_cfg, NULL, &rx_chan));
    }

    i2s_std_config_t i2s_config = I2S_STD_CHAN_CFG(rate, bits_cfg, ch);
    if (slot_mask >= 0 && (i2s_std_slot_mask_t)slot_mask <= I2S_STD_SLOT_BOTH)
    {
        i2s_config.slot_cfg.slot_mask = (i2s_std_slot_mask_t)slot_mask;
    }
    if (tx_chan != NULL)
    {
        tx_sample_rate = rate;
        tx_data_bit_width = bits_cfg;
        tx_slot_mode = ch;
        I2S_ERROR_CHECK_RETURN_FALSE(i2s_channel_init_std_mode(tx_chan, &i2s_config));
        I2S_ERROR_CHECK_RETURN_FALSE(i2s_channel_enable(tx_chan));
    }
    if (rx_chan != NULL)
    {
        rx_sample_rate = rate;
        rx_data_bit_width = bits_cfg;
        rx_slot_mode = ch;
        I2S_ERROR_CHECK_RETURN_FALSE(i2s_channel_init_std_mode(rx_chan, &i2s_config));
        I2S_ERROR_CHECK_RETURN_FALSE(i2s_channel_enable(rx_chan));
    }

    // Peripheral manager set bus type to I2S
    if (_mclk >= 0)
    {
        if (!perimanSetPinBus(_mclk, ESP32_BUS_TYPE_I2S_STD_MCLK, (void *)(this), -1, -1))
        {
            goto err;
        }
    }
    if (_bclk >= 0)
    {
        if (!perimanSetPinBus(_bclk, ESP32_BUS_TYPE_I2S_STD_BCLK, (void *)(this), -1, -1))
        {
            goto err;
        }
    }
    if (_ws >= 0)
    {
        if (!perimanSetPinBus(_ws, ESP32_BUS_TYPE_I2S_STD_WS, (void *)(this), -1, -1))
        {
            goto err;
        }
    }
    if (_dout >= 0)
    {
        if (!perimanSetPinBus(_dout, ESP32_BUS_TYPE_I2S_STD_DOUT, (void *)(this), -1, -1))
        {
            goto err;
        }
    }
    if (_din >= 0)
    {
        if (!perimanSetPinBus(_din, ESP32_BUS_TYPE_I2S_STD_DIN, (void *)(this), -1, -1))
        {
            goto err;
        }
    }

    return true;
err:
    log_e("Failed to set all pins bus to I2S_STD");
    I2sDriver::i2sDetachBus((void *)(this));
    return false;
}

#if SOC_I2S_SUPPORTS_TDM
bool I2sDriver::initTDM(uint32_t rate, i2s_data_bit_width_t bits_cfg, i2s_slot_mode_t ch, int8_t slot_mask)
{
    // Peripheral manager deinit previous peripheral if pin was used
    if (_mclk >= 0)
    {
        if (!perimanClearPinBus(_mclk))
        {
            return false;
        }
    }
    if (_bclk >= 0)
    {
        if (!perimanClearPinBus(_bclk))
        {
            return false;
        }
    }
    if (_ws >= 0)
    {
        if (!perimanClearPinBus(_ws))
        {
            return false;
        }
    }
    if (_dout >= 0)
    {
        if (!perimanClearPinBus(_dout))
        {
            return false;
        }
    }
    if (_din >= 0)
    {
        if (!perimanClearPinBus(_din))
        {
            return false;
        }
    }

    // Set peripheral manager detach function for I2S
    if (_mclk >= 0)
    {
        perimanSetBusDeinit(ESP32_BUS_TYPE_I2S_TDM_MCLK, I2sDriver::i2sDetachBus);
    }
    if (_bclk >= 0)
    {
        perimanSetBusDeinit(ESP32_BUS_TYPE_I2S_TDM_BCLK, I2sDriver::i2sDetachBus);
    }
    if (_ws >= 0)
    {
        perimanSetBusDeinit(ESP32_BUS_TYPE_I2S_TDM_WS, I2sDriver::i2sDetachBus);
    }
    if (_dout >= 0)
    {
        perimanSetBusDeinit(ESP32_BUS_TYPE_I2S_TDM_DOUT, I2sDriver::i2sDetachBus);
    }
    if (_din >= 0)
    {
        perimanSetBusDeinit(ESP32_BUS_TYPE_I2S_TDM_DIN, I2sDriver::i2sDetachBus);
    }

    // I2S configuration
    if (_dout >= 0 && _din >= 0)
    {
        i2s_chan_config_t chan_cfg = I2S_CHAN_CFG(I2S_NUM_AUTO);
        I2S_ERROR_CHECK_RETURN_FALSE(i2s_new_channel(&chan_cfg, &tx_chan, &rx_chan));
    }
    else if (_dout >= 0)
    {
        i2s_chan_config_t chan_cfg = I2S_CHAN_CFG(I2S_NUM_1);
        I2S_ERROR_CHECK_RETURN_FALSE(i2s_new_channel(&chan_cfg, &tx_chan, NULL));
    }
    else if (_din >= 0)
    {
        i2s_chan_config_t chan_cfg = I2S_CHAN_CFG(I2S_NUM_0);
        I2S_ERROR_CHECK_RETURN_FALSE(i2s_new_channel(&chan_cfg, NULL, &rx_chan));
    }

    i2s_tdm_config_t i2s_tdm_config = I2S_TDM_CHAN_CFG(rate, bits_cfg, ch, (i2s_tdm_slot_mask_t)slot_mask);
    if (tx_chan != NULL)
    {
        tx_sample_rate = rate;
        tx_data_bit_width = bits_cfg;
        tx_slot_mode = ch;
        I2S_ERROR_CHECK_RETURN_FALSE(i2s_channel_init_tdm_mode(tx_chan, &i2s_tdm_config));
        I2S_ERROR_CHECK_RETURN_FALSE(i2s_channel_enable(tx_chan));
    }
    if (rx_chan != NULL)
    {
        rx_sample_rate = rate;
        rx_data_bit_width = bits_cfg;
        rx_slot_mode = ch;
        I2S_ERROR_CHECK_RETURN_FALSE(i2s_channel_init_tdm_mode(rx_chan, &i2s_tdm_config));
        I2S_ERROR_CHECK_RETURN_FALSE(i2s_channel_enable(rx_chan));
    }

    // Peripheral manager set bus type to I2S
    if (_mclk >= 0)
    {
        if (!perimanSetPinBus(_mclk, ESP32_BUS_TYPE_I2S_TDM_MCLK, (void *)(this), -1, -1))
        {
            goto err;
        }
    }
    if (_bclk >= 0)
    {
        if (!perimanSetPinBus(_bclk, ESP32_BUS_TYPE_I2S_TDM_BCLK, (void *)(this), -1, -1))
        {
            goto err;
        }
    }
    if (_ws >= 0)
    {
        if (!perimanSetPinBus(_ws, ESP32_BUS_TYPE_I2S_TDM_WS, (void *)(this), -1, -1))
        {
            goto err;
        }
    }
    if (_dout >= 0)
    {
        if (!perimanSetPinBus(_dout, ESP32_BUS_TYPE_I2S_TDM_DOUT, (void *)(this), -1, -1))
        {
            goto err;
        }
    }
    if (_din >= 0)
    {
        if (!perimanSetPinBus(_din, ESP32_BUS_TYPE_I2S_TDM_DIN, (void *)(this), -1, -1))
        {
            goto err;
        }
    }

