makingrobot/esp32-cpp-lesson/src/framework/board/i2s_driver.cpp
    return true;
err:
    log_e("Failed to set all pins bus to I2S_TDM");
    I2sDriver::i2sDetachBus((void *)(this));
    return false;
}
#endif

#if SOC_I2S_SUPPORTS_PDM_TX
bool I2sDriver::initPDMtx(uint32_t rate, i2s_data_bit_width_t bits_cfg, i2s_slot_mode_t ch)
{
    // Peripheral manager deinit previous peripheral if pin was used
    if (_tx_clk >= 0)
    {
        if (!perimanClearPinBus(_tx_clk))
        {
            return false;
        }
    }
    if (_tx_dout0 >= 0)
    {
        if (!perimanClearPinBus(_tx_dout0))
        {
            return false;
        }
    }
    if (_tx_dout1 >= 0)
    {
        if (!perimanClearPinBus(_tx_dout1))
        {
            return false;
        }
    }

    // Set peripheral manager detach function for I2S
    if (_tx_clk >= 0)
    {
        perimanSetBusDeinit(ESP32_BUS_TYPE_I2S_PDM_TX_CLK, I2sDriver::i2sDetachBus);
    }
    if (_tx_dout0 >= 0)
    {
        perimanSetBusDeinit(ESP32_BUS_TYPE_I2S_PDM_TX_DOUT0, I2sDriver::i2sDetachBus);
    }
    if (_tx_dout1 >= 0)
    {
        perimanSetBusDeinit(ESP32_BUS_TYPE_I2S_PDM_TX_DOUT1, I2sDriver::i2sDetachBus);
    }

    // I2S configuration
    i2s_chan_config_t chan_cfg = I2S_CHAN_CFG(I2S_NUM_1);
    I2S_ERROR_CHECK_RETURN_FALSE(i2s_new_channel(&chan_cfg, &tx_chan, NULL));

    i2s_pdm_tx_config_t i2s_pdm_tx_config = I2S_PDM_TX_CHAN_CFG(rate, bits_cfg, ch);
    if (tx_chan != NULL)
    {
        tx_sample_rate = rate;
        tx_data_bit_width = bits_cfg;
        tx_slot_mode = ch;
        I2S_ERROR_CHECK_RETURN_FALSE(i2s_channel_init_pdm_tx_mode(tx_chan, &i2s_pdm_tx_config));
        I2S_ERROR_CHECK_RETURN_FALSE(i2s_channel_enable(tx_chan));
    }

    // Peripheral manager set bus type to I2S
    if (_tx_clk >= 0)
    {
        if (!perimanSetPinBus(_tx_clk, ESP32_BUS_TYPE_I2S_PDM_TX_CLK, (void *)(this), -1, -1))
        {
            goto err;
        }
    }
    if (_tx_dout0 >= 0)
    {
        if (!perimanSetPinBus(_tx_dout0, ESP32_BUS_TYPE_I2S_PDM_TX_DOUT0, (void *)(this), -1, -1))
        {
            goto err;
        }
    }
    if (_tx_dout1 >= 0)
    {
        if (!perimanSetPinBus(_tx_dout1, ESP32_BUS_TYPE_I2S_PDM_TX_DOUT1, (void *)(this), -1, -1))
        {
            goto err;
        }
    }

    return true;
err:
    log_e("Failed to set all pins bus to I2S_TDM");
    I2sDriver::i2sDetachBus((void *)(this));
    return false;
}
#endif

#if SOC_I2S_SUPPORTS_PDM_RX
bool I2sDriver::initPDMrx(uint32_t rate, i2s_data_bit_width_t bits_cfg, i2s_slot_mode_t ch)
{
    // Peripheral manager deinit previous peripheral if pin was used
    if (_rx_clk >= 0)
    {
        if (!perimanClearPinBus(_rx_clk))
        {
            return false;
        }
    }
    if (_rx_din0 >= 0)
    {
        if (!perimanClearPinBus(_rx_din0))
        {
            return false;
        }
    }
    if (_rx_din1 >= 0)
    {
        if (!perimanClearPinBus(_rx_din1))
        {
            return false;
        }
    }
    if (_rx_din2 >= 0)
    {
        if (!perimanClearPinBus(_rx_din2))
        {
            return false;
        }
    }
    if (_rx_din3 >= 0)
    {
        if (!perimanClearPinBus(_rx_din3))
        {
            return false;
        }
    }

    // Set peripheral manager detach function for I2S
    if (_rx_clk >= 0)
    {
        perimanSetBusDeinit(ESP32_BUS_TYPE_I2S_PDM_RX_CLK, I2sDriver::i2sDetachBus);
    }
    if (_rx_din0 >= 0)
    {
        perimanSetBusDeinit(ESP32_BUS_TYPE_I2S_PDM_RX_DIN0, I2sDriver::i2sDetachBus);
    }
    if (_rx_din1 >= 0)
    {
        perimanSetBusDeinit(ESP32_BUS_TYPE_I2S_PDM_RX_DIN1, I2sDriver::i2sDetachBus);
    }
    if (_rx_din2 >= 0)
    {
        perimanSetBusDeinit(ESP32_BUS_TYPE_I2S_PDM_RX_DIN2, I2sDriver::i2sDetachBus);
    }
    if (_rx_din3 >= 0)
    {
        perimanSetBusDeinit(ESP32_BUS_TYPE_I2S_PDM_RX_DIN3, I2sDriver::i2sDetachBus);
    }

    // I2S configuration
    i2s_chan_config_t chan_cfg = I2S_CHAN_CFG(I2S_NUM_0);
    I2S_ERROR_CHECK_RETURN_FALSE(i2s_new_channel(&chan_cfg, NULL, &rx_chan));

    i2s_pdm_rx_config_t i2s_pdf_rx_config = I2S_PDM_RX_CHAN_CFG(rate, bits_cfg, ch);
    if (rx_chan != NULL)
    {
        rx_sample_rate = rate;
        rx_data_bit_width = bits_cfg;
        rx_slot_mode = ch;
        I2S_ERROR_CHECK_RETURN_FALSE(i2s_channel_init_pdm_rx_mode(rx_chan, &i2s_pdf_rx_config));
        I2S_ERROR_CHECK_RETURN_FALSE(i2s_channel_enable(rx_chan));
    }

    // Peripheral manager set bus type to I2S
    if (_rx_clk >= 0)
    {
        if (!perimanSetPinBus(_rx_clk, ESP32_BUS_TYPE_I2S_PDM_RX_CLK, (void *)(this), -1, -1))
        {
            goto err;
        }
    }
    if (_rx_din0 >= 0)
    {
        if (!perimanSetPinBus(_rx_din0, ESP32_BUS_TYPE_I2S_PDM_RX_DIN0, (void *)(this), -1, -1))
        {
            goto err;
        }
    }
    if (_rx_din1 >= 0)
    {
        if (!perimanSetPinBus(_rx_din1, ESP32_BUS_TYPE_I2S_PDM_RX_DIN1, (void *)(this), -1, -1))
        {
            goto err;
        }
    }
    if (_rx_din2 >= 0)
    {
        if (!perimanSetPinBus(_rx_din2, ESP32_BUS_TYPE_I2S_PDM_RX_DIN2, (void *)(this), -1, -1))
        {
            goto err;
        }
    }
    if (_rx_din3 >= 0)
    {
        if (!perimanSetPinBus(_rx_din3, ESP32_BUS_TYPE_I2S_PDM_RX_DIN3, (void *)(this), -1, -1))
        {
            goto err;
        }
    }

    return true;
err:
    log_e("Failed to set all pins bus to I2S_TDM");
    I2sDriver::i2sDetachBus((void *)(this));
    return false;
}
#endif

bool I2sDriver::begin(i2s_mode_t mode, uint32_t rate, i2s_data_bit_width_t bits_cfg, i2s_slot_mode_t ch, int8_t slot_mask)
{
    /* Setup I2S peripheral */
    if (mode >= I2S_MODE_MAX)
    {
        log_e("Invalid I2S mode selected.");
        return false;
    }
    _mode = mode;

    bool init = false;
    switch (_mode)
    {
    case I2S_MODE_STD:
        init = initSTD(rate, bits_cfg, ch, slot_mask);
        break;
#if SOC_I2S_SUPPORTS_TDM
    case I2S_MODE_TDM:
        init = initTDM(rate, bits_cfg, ch, slot_mask);
        break;
#endif
#if SOC_I2S_SUPPORTS_PDM_TX
    case I2S_MODE_PDM_TX:
        init = initPDMtx(rate, bits_cfg, ch);
        break;
#endif
#if SOC_I2S_SUPPORTS_PDM_RX
    case I2S_MODE_PDM_RX:
        init = initPDMrx(rate, bits_cfg, ch);
        break;
#endif
    default:
        break;
    }

    if (init == false)
    {
        log_e("I2S initialization failed.");
        return false;
    }
    return true;
}

bool I2sDriver::end()
{
    if (tx_chan != NULL)
    {
        I2S_ERROR_CHECK_RETURN_FALSE(i2s_channel_disable(tx_chan));
        I2S_ERROR_CHECK_RETURN_FALSE(i2s_del_channel(tx_chan));
        tx_chan = NULL;
    }
    if (rx_chan != NULL)
    {
        I2S_ERROR_CHECK_RETURN_FALSE(i2s_channel_disable(rx_chan));
        I2S_ERROR_CHECK_RETURN_FALSE(i2s_del_channel(rx_chan));
        rx_chan = NULL;
    }
    if (rx_transform_buf != NULL)
    {
        free(rx_transform_buf);
        rx_transform_buf = NULL;
        rx_transform_buf_len = 0;
    }

