makingrobot/esp32-cpp-lesson/src/framework/board/i2s_driver.cpp
    // Peripheral manager deinit used pins
    switch (_mode)
    {
    case I2S_MODE_STD:
#if SOC_I2S_SUPPORTS_TDM
    case I2S_MODE_TDM:
#endif
        if (_mclk >= 0)
        {
            perimanClearPinBus(_mclk);
        }
        if (_bclk >= 0)
        {
            perimanClearPinBus(_bclk);
        }
        if (_ws >= 0)
        {
            perimanClearPinBus(_ws);
        }
        if (_dout >= 0)
        {
            perimanClearPinBus(_dout);
        }
        if (_din >= 0)
        {
            perimanClearPinBus(_din);
        }
        break;
#if SOC_I2S_SUPPORTS_PDM_TX
    case I2S_MODE_PDM_TX:
        perimanClearPinBus(_tx_clk);
        if (_tx_dout0 >= 0)
        {
            perimanClearPinBus(_tx_dout0);
        }
        if (_tx_dout1 >= 0)
        {
            perimanClearPinBus(_tx_dout1);
        }
        break;
#endif
#if SOC_I2S_SUPPORTS_PDM_RX
    case I2S_MODE_PDM_RX:
        perimanClearPinBus(_rx_clk);
        if (_rx_din0 >= 0)
        {
            perimanClearPinBus(_rx_din0);
        }
        if (_rx_din1 >= 0)
        {
            perimanClearPinBus(_rx_din1);
        }
        if (_rx_din2 >= 0)
        {
            perimanClearPinBus(_rx_din2);
        }
        if (_rx_din3 >= 0)
        {
            perimanClearPinBus(_rx_din3);
        }
        break;
#endif
    default:
        break;
    }
    return true;
}

bool I2sDriver::configureTX(uint32_t rate, i2s_data_bit_width_t bits_cfg, i2s_slot_mode_t ch, int8_t slot_mask)
{
    /* Setup I2S channels */
    if (tx_chan != NULL)
    {
        if (tx_sample_rate == rate && tx_data_bit_width == bits_cfg && tx_slot_mode == ch)
        {
            return true;
        }
        i2s_std_config_t i2s_config = I2S_STD_CHAN_CFG(rate, bits_cfg, ch);
        if (slot_mask >= 0 && (i2s_std_slot_mask_t)slot_mask <= I2S_STD_SLOT_BOTH)
        {
            i2s_config.slot_cfg.slot_mask = (i2s_std_slot_mask_t)slot_mask;
        }
        I2S_ERROR_CHECK_RETURN_FALSE(i2s_channel_disable(tx_chan));
        I2S_ERROR_CHECK_RETURN_FALSE(i2s_channel_reconfig_std_clock(tx_chan, &i2s_config.clk_cfg));
        tx_sample_rate = rate;
        I2S_ERROR_CHECK_RETURN_FALSE(i2s_channel_reconfig_std_slot(tx_chan, &i2s_config.slot_cfg));
        tx_data_bit_width = bits_cfg;
        tx_slot_mode = ch;
        I2S_ERROR_CHECK_RETURN_FALSE(i2s_channel_enable(tx_chan));
        return true;
    }
    return false;
}

bool I2sDriver::configureRX(uint32_t rate, i2s_data_bit_width_t bits_cfg, i2s_slot_mode_t ch, i2s_rx_transform_t transform)
{
    /* Setup I2S channels */
    if (rx_chan != NULL)
    {
        if (rx_sample_rate != rate || rx_data_bit_width != bits_cfg || rx_slot_mode != ch)
        {
            i2s_std_config_t i2s_config = I2S_STD_CHAN_CFG(rate, bits_cfg, ch);
            I2S_ERROR_CHECK_RETURN_FALSE(i2s_channel_disable(rx_chan));
            I2S_ERROR_CHECK_RETURN_FALSE(i2s_channel_reconfig_std_clock(rx_chan, &i2s_config.clk_cfg));
            rx_sample_rate = rate;
            I2S_ERROR_CHECK_RETURN_FALSE(i2s_channel_reconfig_std_slot(rx_chan, &i2s_config.slot_cfg));
            rx_data_bit_width = bits_cfg;
            rx_slot_mode = ch;
            I2S_ERROR_CHECK_RETURN_FALSE(i2s_channel_enable(rx_chan));
            return transformRX(transform);
        }
        if (rx_transform != transform)
        {
            return transformRX(transform);
        }
        return true;
    }
    return false;
}

size_t I2sDriver::readBytes(char *buffer, size_t size)
{
    size_t readed = 0;
    size_t bytes_read = 0;
    size_t bytes_to_read = 0;
    last_error = ESP_FAIL;
    if (rx_chan == NULL)
    {
        return readed;
    }
    while (readed < size)
    {
        bytes_read = 0;
        bytes_to_read = size - bytes_read;
        if (rx_transform_buf != NULL && bytes_to_read > I2S_READ_CHUNK_SIZE) {
            bytes_to_read = I2S_READ_CHUNK_SIZE;
        }
        I2S_ERROR_CHECK_RETURN(rx_fn(rx_chan, rx_transform_buf, (char *)(buffer + readed), bytes_to_read, &bytes_read, _timeout), 0);
        readed += bytes_read;
    }
    return readed;
}

size_t I2sDriver::write(const uint8_t *buffer, size_t size)
{
    size_t written = 0;
    size_t bytes_sent = 0;
    size_t bytes_to_send = 0;
    last_error = ESP_FAIL;
    if (tx_chan == NULL)
    {
        return written;
    }
    while (written < size)
    {
        bytes_sent = 0;
        bytes_to_send = size - written;
        esp_err_t err = i2s_channel_write(tx_chan, (char *)(buffer + written), bytes_to_send, &bytes_sent, _timeout);
        I2S_ERROR_CHECK_RETURN(err, written);
        written += bytes_sent;
    }
    return written;
}

bool I2sDriver::transformRX(i2s_rx_transform_t transform)
{
    switch (transform)
    {
    case I2S_RX_TRANSFORM_NONE:
        allocTranformRX(0);
        rx_fn = i2s_channel_read_default;
        break;

    case I2S_RX_TRANSFORM_32_TO_16:
        if (rx_data_bit_width != I2S_DATA_BIT_WIDTH_32BIT)
        {
            log_e("Wrong data width. Should be 32bit");
            return false;
        }
        if (!allocTranformRX(I2S_READ_CHUNK_SIZE * 2))
        {
            return false;
        }
        rx_fn = i2s_channel_read_32_to_16;
        rx_data_bit_width = I2S_DATA_BIT_WIDTH_16BIT;
        break;

    case I2S_RX_TRANSFORM_16_STEREO_TO_MONO:
        if (rx_slot_mode != I2S_SLOT_MODE_STEREO)
        {
            log_e("Wrong slot mode. Should be Stereo");
            return false;
        }
        if (!allocTranformRX(I2S_READ_CHUNK_SIZE * 2))
        {
            return false;
        }
        rx_fn = i2s_channel_read_16_stereo_to_mono;
        rx_slot_mode = I2S_SLOT_MODE_MONO;
        break;

    default:
        log_e("Unknown RX Transform %d", transform);
        return false;
    }
    rx_transform = transform;
    return true;
}

bool I2sDriver::allocTranformRX(size_t buf_len)
{
    char *buf = NULL;
    if (buf_len == 0)
    {
        if (rx_transform_buf != NULL)
        {
            free(rx_transform_buf);
            rx_transform_buf = NULL;
            rx_transform_buf_len = 0;
        }
        return true;
    }
    if (rx_transform_buf == NULL || rx_transform_buf_len != buf_len)
    {
        buf = (char *)malloc(buf_len);
        if (buf == NULL)
        {
            log_e("malloc %u failed!", buf_len);
            return false;
        }
        if (rx_transform_buf != NULL)
        {
            free(rx_transform_buf);
        }
        rx_transform_buf = buf;
        rx_transform_buf_len = buf_len;
    }
    return true;
}

#endif